# NamingUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
NamingUtils Class
Members See Also
---
A collection of utilities related to element naming.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static class NamingUtils
```

Visual Basic
---
```text
Public NotInheritable Class NamingUtils
```

Visual C++
---
```text
public ref class NamingUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..NamingUtils
# See Also
NamingUtils Members
Autodesk.Revit.DB Namespace